<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"626a29bb41f6bfb042c5b055c2228dbc9b7109d57d23735fc2bc3c50092ef3bc","plan_job_ref":"Job Create Terraform plan (DEV) #175 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15214192767","plan_out_hash":"499a56ebdb12da2ee45ba9146fde8dc1fa45ed4bc96252b49129707aa41b1ff9","plan_hash":"debed80fef11ea957341c6d2098715a7e2e8e8bb13da6b0cd5c9c6708d952579","plan_text_format":"diff-trunc","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 24 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be created
+   resource "azurerm_container_registry" "acr" {
+       admin_enabled                 = false
+       admin_password                = (sensitive value)
+       admin_username                = (known after apply)
+       encryption                    = (known after apply)
+       export_policy_enabled         = true
+       id                            = (known after apply)
+       location                      = "francecentral"
+       login_server                  = (known after apply)
+       name                          = "openmrsacrdev"
+       network_rule_bypass_option    = "AzureServices"
+       network_rule_set              = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "rg-openmrscore-dev"
+       sku                           = "Standard"
+       trust_policy_enabled          = false
+       zone_redundancy_enabled       = false
    }

  # azurerm_dns_zone.audioprothese_ovh will be created
+   resource "azurerm_dns_zone" "audioprothese_ovh" {
+       id                        = (known after apply)
+       max_number_of_record_sets = (known after apply)
+       name                      = "audioprothese.ovh"
+       name_servers              = (known after apply)
+       number_of_record_sets     = (known after apply)
+       resource_group_name       = "rg-openmrscore-dev"

+       soa_record (known after apply)
    }

  # azurerm_federated_identity_credential.eso_federated_identity will be created
+   resource "azurerm_federated_identity_credential" "eso_federated_identity" {
+       audience            = [
+           "api://AzureADTokenExchange",
        ]
+       id                  = (known after apply)
+       issuer              = (known after apply)
+       name                = "eso-federated-credential"
+       parent_id           = (known after apply)
+       resource_group_name = "rg-openmrscore-dev"
+       subject             = "system:serviceaccount:eso:workload-identity-sa"
    }

  # azurerm_key_vault.vault will be created
+   resource "azurerm_key_vault" "vault" {
+       access_policy                 = (known after apply)
+       enable_rbac_authorization     = true
+       enabled_for_disk_encryption   = true
+       id                            = (known after apply)
+       location                      = "francecentral"
+       name                          = "openmrs-dev-vault"
+       public_network_access_enabled = true
+       purge_protection_enabled      = false
+       resource_group_name           = "rg-openmrscore-dev"
+       sku_name                      = "standard"
+       soft_delete_retention_days    = 7
+       tenant_id                     = "************************************"
+       vault_uri                     = (known after apply)

+       contact (known after apply)

+       network_acls (known after apply)
    }

  # azurerm_kubernetes_cluster.aks will be created
+   resource "azurerm_kubernetes_cluster" "aks" {
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = "openmrs-dev-audioprothese-dns-aks"
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "francecentral"
+       name                                = "openmrs-dev-audioprothese-aks"
+       node_os_upgrade_channel             = "NodeImage"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_enabled                 = true
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       resource_group_name                 = "rg-openmrscore-dev"
+       role_based_access_control_enabled   = true
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       tags                                = {
+           "Environment"  = "dev"
+           "organization" = "audioprothese"
+           "project"      = "openmrs"
        }
+       workload_identity_enabled           = true

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           kubelet_disk_type    = (known after apply)
+           max_pods             = (known after apply)
+           name                 = "default"
+           node_count           = 2
+           node_labels          = (known after apply)
+           orchestrator_version = (known after apply)
+           os_disk_size_gb      = (known after apply)
+           os_disk_type         = "Managed"
+           os_sku               = (known after apply)
+           scale_down_mode      = "Delete"
+           type                 = "VirtualMachineScaleSets"
+           ultra_ssd_enabled    = false
+           vm_size              = "Standard_D2_v2"
+           workload_runtime     = (known after apply)
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity (known after apply)

+       network_profile (known after apply)

+       web_app_routing {
+           dns_zone_ids             = (known after apply)
+           web_app_routing_identity = (known after apply)
        }

+       windows_profile (known after apply)
    }

  # azurerm_role_assignment.acr_pull will be created
+   resource "azurerm_role_assignment" "acr_pull" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "AcrPull"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aks_dns will be created
+   resource "azurerm_role_assignment" "aks_dns" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "DNS Zone Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.eso_keyvault_secrets_user will be created
+   resource "azurerm_role_assignment" "eso_keyvault_secrets_user" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets User"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.external_dns will be created
+   resource "azurerm_role_assignment" "external_dns" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "DNS Zone Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.user_keyvault_secret_access will be created
+   resource "azurerm_role_assignment" "user_keyvault_secret_access" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = "User"
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Administrator"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_user_assigned_identity.eso_workload_identity will be created
+   resource "azurerm_user_assigned_identity" "eso_workload_identity" {
+       client_id           = (known after apply)
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "eso-workload-identity"
+       principal_id        = (known after apply)
+       resource_group_name = "rg-openmrscore-dev"
+       tenant_id           = (known after apply)
    }

  # helm_release.alloy will be created
+   resource "helm_release" "alloy" {
+       atomic                     = false
+       chart                      = "alloy"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "alloy"
+       namespace                  = "alloy"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                alloy:
                  configMap:
                    content: |
                      loki.write "default" {
                        endpoint {
                          url = "http://loki-gateway.loki.svc.cluster.local/loki/api/v1/push"
                        }
                      }
                      // local.file_match discovers files on the local filesystem using glob patterns and the doublestar library. It returns an array of file paths.
                      local.file_match "node_logs" {
                        path_targets = [{
                            // Monitor syslog to scrape node-logs
                            __path__  = "/var/log/syslog",
                            job       = "node/syslog",
                            node_name = sys.env("HOSTNAME"),
                            cluster   = "dev",
                        }]
                      }
                
                      // loki.source.file reads log entries from files and forwards them to other loki.* components.
                      // You can specify multiple loki.source.file components by giving them different labels.
                      loki.source.file "node_logs" {
                        targets    = local.file_match.node_logs.targets
                        forward_to = [loki.write.default.receiver]
                      }
                
                      // discovery.kubernetes allows you to find scrape targets from Kubernetes resources.
                      // It watches cluster state and ensures targets are continually synced with what is currently running in your cluster.
                      discovery.kubernetes "pod" {
                        role = "pod"
                      }
                
                      // discovery.relabel rewrites the label set of the input targets by applying one or more relabeling rules.
                      // If no rules are defined, then the input targets are exported as-is.
                      discovery.relabel "pod_logs" {
                        targets = discovery.kubernetes.pod.targets
                
                        // Label creation - "namespace" field from "__meta_kubernetes_namespace"
                        rule {
                          source_labels = ["__meta_kubernetes_namespace"]
                          action = "replace"
                          target_label = "namespace"
                        }
                
                        // Label creation - "pod" field from "__meta_kubernetes_pod_name"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_name"]
                          action = "replace"
                          target_label = "pod"
                        }
                
                        // Label creation - "container" field from "__meta_kubernetes_pod_container_name"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_container_name"]
                          action = "replace"
                          target_label = "container"
                        }
                
                        // Label creation -  "app" field from "__meta_kubernetes_pod_label_app_kubernetes_io_name"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_label_app_kubernetes_io_name"]
                          action = "replace"
                          target_label = "app"
                        }
                
                        // Label creation -  "job" field from "__meta_kubernetes_namespace" and "__meta_kubernetes_pod_container_name"
                        // Concatenate values __meta_kubernetes_namespace/__meta_kubernetes_pod_container_name
                        rule {
                          source_labels = ["__meta_kubernetes_namespace", "__meta_kubernetes_pod_container_name"]
                          action = "replace"
                          target_label = "job"
                          separator = "/"
                          replacement = "$1"
                        }
                
                        // Label creation - "container" field from "__meta_kubernetes_pod_uid" and "__meta_kubernetes_pod_container_name"
                        // Concatenate values __meta_kubernetes_pod_uid/__meta_kubernetes_pod_container_name.log
                        rule {
                          source_labels = ["__meta_kubernetes_pod_uid", "__meta_kubernetes_pod_container_name"]
                          action = "replace"
                          target_label = "__path__"
                          separator = "/"
                          replacement = "/var/log/pods/*$1/*.log"
                        }
                
                        // Label creation -  "container_runtime" field from "__meta_kubernetes_pod_container_id"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_container_id"]
                          action = "replace"
                          target_label = "container_runtime"
                          regex = "^(\\S+):\\/\\/.+$"
                          replacement = "$1"
                        }
                      }
                
                      // loki.source.kubernetes tails logs from Kubernetes containers using the Kubernetes API.
                      loki.source.kubernetes "pod_logs" {
                        targets    = discovery.relabel.pod_logs.output
                        forward_to = [loki.process.pod_logs.receiver]
                      }
                
                      // loki.process receives log entries from other Loki components, applies one or more processing stages,
                      // and forwards the results to the list of receivers in the component's arguments.
                      loki.process "pod_logs" {
                        stage.static_labels {
                            values = {
                              cluster = "dev",
                            }
                        }
                
                        forward_to = [loki.write.default.receiver]
                      }
                
                      // loki.source.kubernetes_events tails events from the Kubernetes API and converts them
                      // into log lines to forward to other Loki components.
                      loki.source.kubernetes_events "cluster_events" {
                        job_name   = "integrations/kubernetes/eventhandler"
                        log_format = "logfmt"
                        forward_to = [
                          loki.process.cluster_events.receiver,
                        ]
                      }
                
                      // loki.process receives log entries from other loki components, applies one or more processing stages,
                      // and forwards the results to the list of receivers in the component's arguments.
                      loki.process "cluster_events" {
                        forward_to = [loki.write.default.receiver]
                
                        stage.static_labels {
                          values = {
                            cluster = "dev",
                          }
                        }
                
                        stage.labels {
                          values = {
                            kubernetes_cluster_events = "job",
                          }
                        }
                      }
                
                ingress:
                  enabled: true
                  ingressClassName: "webapprouting.kubernetes.azure.com"
                  annotations:
                    cert-manager.io/cluster-issuer: letsencrypt-prod
                    nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                    nginx.ingress.kubernetes.io/auth-url: "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
                    nginx.ingress.kubernetes.io/auth-signin: "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
                  labels: {}
                  path: /
                  pathType: Prefix
                  hosts:
                    - alloy.dev.audioprothese.ovh
                  faroPort: 12345
                  extraPaths: []
                  tls:
                    - secretName: alloy-tls
                      hosts:
                        - alloy.dev.audioprothese.ovh
            EOT,
        ]
+       verify                     = false
+       version                    = "1.0.3"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.argocd will be created
+   resource "helm_release" "argocd" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                global:
                  domain: argocd.dev.audioprothese.ovh
                
                certificate:
                  enabled: true
                
                server:
                  autoscaling:
                    enabled: false
                  ingress:
                    enabled: true
                    ingressClassName: webapprouting.kubernetes.azure.com
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      appgw.ingress.kubernetes.io/backend-protocol: "https"
                      nginx.ingress.kubernetes.io/auth-url: "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
                      nginx.ingress.kubernetes.io/auth-signin: "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
                    tls: true
                
                redis-ha:
                  enabled: false
                
                controller:
                  replicas: 1
                
                repoServer:
                  autoscaling:
                    enabled: false
                
                applicationSet:
                  replicas: 1
                
                configs:
                  params:
                    server.insecure: true
                    server.disable.auth: true
            EOT,
        ]
+       verify                     = false
+       version                    = "8.0.3"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.cert_manager will be created
+   resource "helm_release" "cert_manager" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "cert-manager"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                crds:
                  enabled: true
            EOT,
        ]
+       verify                     = false
+       version                    = "v1.17.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.eso will be created
+   resource "helm_release" "eso" {
+       atomic                     = false
+       chart                      = "external-secrets"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "eso"
+       namespace                  = "eso"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.external-secrets.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                "serviceAccount":
                  "create": false
                  "name": "workload-identity-sa"
            EOT,
        ]
+       verify                     = false
+       version                    = "0.17.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.loki will be created
+   resource "helm_release" "loki" {
+       atomic                     = false
+       chart                      = "loki"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "loki"
+       namespace                  = "loki"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                loki:
                  commonConfig:
                    replication_factor: 1
                  schemaConfig:
                    configs:
                      - from: "2024-04-01"
                        store: tsdb
                        object_store: s3
                        schema: v13
                        index:
                          prefix: loki_index_
                          period: 24h
                  pattern_ingester:
                    enabled: true
                  limits_config:
                    allow_structured_metadata: true
                    volume_enabled: true
                  ruler:
                    enable_api: true
                  auth_enabled: false
                
                minio:
                  enabled: true
                
                deploymentMode: SingleBinary
                
                singleBinary:
                  replicas: 1
                
                backend:
                  replicas: 0
                read:
                  replicas: 0
                write:
                  replicas: 0
                
                ingester:
                  replicas: 0
                querier:
                  replicas: 0
                queryFrontend:
                  replicas: 0
                queryScheduler:
                  replicas: 0
                distributor:
                  replicas: 0
                compactor:
                  replicas: 0
                indexGateway:
                  replicas: 0
                bloomCompactor:
                  replicas: 0
                bloomGateway:
                  replicas: 0
                
                resultsCache:
                  enabled: false
                
                chunksCache:
                  enabled: false
            EOT,
        ]
+       verify                     = false
+       version                    = "6.29.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.oauth2_proxy will be created
+   resource "helm_release" "oauth2_proxy" {
+       atomic                     = false
+       chart                      = "oauth2-proxy"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "oauth2-proxy"
+       namespace                  = "authgate"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://oauth2-proxy.github.io/manifests"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                proxyVarsAsSecrets: true
                
                sessionStorage:
                  type: redis
                  redis:
                    clientType: standalone
                    standalone:
                      connectionUrl: redis://oauth2-proxy-redis-master:6379/0
                
                initContainers:
                  waitForRedis:
                    enabled: false
                
                redis:
                  enabled: true
                
                config:
                  existingSecret: oauth2-proxy-secret
                
                extraArgs:
                  - --provider=oidc
                  - --oidc-issuer-url=https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0
                  - --scope=openid email profile
                  - --email-domain=*
                  - --redirect-url=https://oauth2.dev.audioprothese.ovh/oauth2/callback
                  - --skip-provider-button
                  - --reverse-proxy
                  - --cookie-secure=true
                  - --cookie-domain=.audioprothese.ovh
                  - --cookie-name=_oauth2_proxy
                  - --cookie-refresh=2m
                  - --cookie-expire=24h
                  - --whitelist-domain=.audioprothese.ovh
                  - --set-authorization-header=false        
                  - --pass-access-token=false               
                  - --pass-user-headers=true              
                  - --set-xauthrequest=true               
                  - --oidc-email-claim=preferred_username
                
                ingress:
                  enabled: true
                  className: webapprouting.kubernetes.azure.com
                  annotations:
                    cert-manager.io/cluster-issuer: letsencrypt-prod
                    nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                  hosts:
                    - oauth2.dev.audioprothese.ovh
                  path: /oauth2
                  pathType: Prefix
                  tls:
                    - secretName: oauth2-tls
                      hosts:
                        - oauth2.dev.audioprothese.ovh
                
                service:
                  type: ClusterIP
                  portNumber: 4180
            EOT,
        ]
+       verify                     = false
+       version                    = "7.12.13"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.openmrs will be created
+   resource "helm_release" "openmrs" {
+       atomic                     = false
+       chart                      = "openmrs"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "openmrs"
+       namespace                  = "openmrs"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "oci://registry-1.docker.io/openmrs"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                ---
                # Global settings
                global:
                  defaultStorageClass: "default"
                
                # OpenMRS Backend settings
                openmrs-backend:
                  image:
                    tag: "latest"
                    repository: "openmrsacrdev.azurecr.io/openmrscore-backend"
                
                # OpenMRS Frontend settings
                openmrs-frontend:
                  image:
                    tag: "latest"
                    repository: "openmrsacrdev.azurecr.io/openmrscore-frontend"
                
                # OpenMRS Gateway settings
                openmrs-gateway:
                  image:
                    tag: "latest"
                    repository: "openmrsacrdev.azurecr.io/openmrscore-gateway"
                
                  service:
                    type: ClusterIP
                    port: 80
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.5"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.prometheus-stack will be created
+   resource "helm_release" "prometheus-stack" {
+       atomic                     = false
+       chart                      = "kube-prometheus-stack"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "prometheus-stack"
+       namespace                  = "monitoring"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://prometheus-community.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                prometheus:
                  ingress:
                    enabled: true
                    ingressClassName: webapprouting.kubernetes.azure.com
                    hosts:
                      - prometheus.dev.audioprothese.ovh
                    path: /
                    pathType: Prefix
                    tls:
                      - hosts:
                          - prometheus.dev.audioprothese.ovh
                        secretName: prometheus-tls
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      nginx.ingress.kubernetes.io/auth-url: "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
                      nginx.ingress.kubernetes.io/auth-signin: "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
                
                alertmanager:
                  ingress:
                    enabled: true
                    ingressClassName: webapprouting.kubernetes.azure.com
                    hosts:
                      - alertmanager.dev.audioprothese.ovh
                    path: /
                    pathType: Prefix
                    tls:
                      - hosts:
                          - alertmanager.dev.audioprothese.ovh
                        secretName: alertmanager-tls
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      nginx.ingress.kubernetes.io/auth-url: "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
                      nginx.ingress.kubernetes.io/auth-signin: "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
                
                  config:
                    global:
                      resolve_timeout: 5m
                
                    route:
                      group_by: ['alertname', 'cluster', 'service']
                      group_wait: 10s
                      group_interval: 10s
                      repeat_interval: 12h
                      receiver: 'ticket-webhook'
                      routes:
                        - match:
                            severity: critical
                          receiver: 'critical-ticket-webhook'
                          group_wait: 0s
                          repeat_interval: 1h
                        
                        - match:
                            severity: warning
                          receiver: 'warning-ticket-webhook'
                          group_wait: 5m
                          repeat_interval: 6h
                
                    receivers:
                      - name: 'ticket-webhook'
                        telegram_configs:
                          - bot_token: '7728769790:AAHMvWSa9KU-gtOknUr3WW-T7D2eNa9vbQA'
                            chat_id: -1002316835762 
                            api_url: 'https://api.telegram.org'
                            send_resolved: true
                            parse_mode: 'HTML'
                            message: |
                              <b>🎯 ALERTE MONITORING</b>
                              
                              <b>Service:</b> {{ .GroupLabels.service | default "inconnu" }}
                              <b>Environnement:</b> {{ .GroupLabels.cluster | default "dev" }}
                              <b>Sévérité:</b> {{ .GroupLabels.severity | default "info" }}
                              
                              {{ range .Alerts }}
                              <b>📋 {{ .Annotations.summary }}</b>
                              {{ .Annotations.description }}
                              <i>Instance:</i> {{ .Labels.instance }}
                              <i>Statut:</i> {{ .Status }}
                              <i>Début:</i> {{ .StartsAt.Format "15:04:05" }}
                              {{ if .EndsAt }}
                              <i>Résolu:</i> {{ .EndsAt.Format "15:04:05" }}
                              {{ end }}
                              
                              {{ end }}
                
                      - name: 'critical-ticket-webhook'
                        telegram_configs:
                          - bot_token: '7728769790:AAHMvWSa9KU-gtOknUr3WW-T7D2eNa9vbQA'
                            chat_id: -1002316835762  
                            api_url: 'https://api.telegram.org'
                            send_resolved: true
                            parse_mode: 'HTML'
                            message: |
                              <b>🚨 ALERTE CRITIQUE 🚨</b>
                              @here @channel
                              
                              <b>Service:</b> {{ .GroupLabels.service | default "inconnu" }}
                              <b>Environnement:</b> {{ .GroupLabels.cluster | default "dev" }}
                              <b>Priorité:</b> HAUTE - ACTION IMMÉDIATE
                              
                              {{ range .Alerts }}
                              <b>⚠️ {{ .Annotations.summary }}</b>
                              {{ .Annotations.description }}
                              <i>Instance:</i> {{ .Labels.instance }}
                              <i>Valeur:</i> {{ .Annotations.current_value | default "N/A" }}
                              <i>Seuil:</i> {{ .Annotations.threshold | default "N/A" }}
                              <i>Début:</i> {{ .StartsAt.Format "15:04:05" }}
                              {{ end }}
                
                      - name: 'warning-ticket-webhook'
                        telegram_configs:
                          - bot_token: '7728769790:AAHMvWSa9KU-gtOknUr3WW-T7D2eNa9vbQA'
                            chat_id: -1002316835762
                            api_url: 'https://api.telegram.org'
                            send_resolved: true
                            parse_mode: 'HTML'
                            message: |
                              <b>⚠️ WARNING</b>
                              
                              <b>Service:</b> {{ .GroupLabels.service | default "inconnu" }}
                              <b>Environnement:</b> {{ .GroupLabels.cluster | default "dev" }}
                              
                              {{ range .Alerts }}
                              <b>{{ .Annotations.summary }}</b>
                              {{ .Annotations.description }}
                              <i>Instance:</i> {{ .Labels.instance }}
                              {{ end }}
                
                    inhibit_rules:
                      - source_match:
                          severity: 'critical'
                        target_match:
                          severity: 'warning'
                        equal: ['alertname', 'instance']
                
                grafana:
                  ingress:
                    enabled: true
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      nginx.ingress.kubernetes.io/auth-url: "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
                      nginx.ingress.kubernetes.io/auth-signin: "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
                      nginx.ingress.kubernetes.io/auth-response-headers: X-Auth-Request-User, X-Auth-Request-Email
                    labels: {}
                    path: /
                    pathType: Prefix
                    hosts:
                      - grafana.dev.audioprothese.ovh
                    tls:
                      - hosts:
                          - grafana.dev.audioprothese.ovh
                        secretName: grafana-tls
                    ingressClassName: "webapprouting.kubernetes.azure.com"
                  
                  datasources:
                    datasources.yaml:
                      apiVersion: 1
                      datasources:
                        - name: Loki
                          type: loki
                          url: http://loki-gateway.loki.svc.cluster.local/
                        - name: Alertmanager
                          type: alertmanager
                          url: http://kube-prometheus-stack-alertmanager:9093
                
                  grafana.ini:
                    server:
                      root_url: "https://grafana.dev.audioprothese.ovh/"
                      domain: "grafana.dev.audioprothese.ovh"
                
                    auth:
                      disable_login_form: true
                      
                    auth.proxy:
                      enabled: true
                      header_name: X-Auth-Request-Email
                      header_property: email
                      auto_sign_up: true
                    
                    users:
                      auto_assign_org: true
                      auto_assign_org_role: Admin
            EOT,
        ]
+       verify                     = false
+       version                    = "72.3.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubectl_manifest.cluster_issuer will be created
+   resource "kubectl_manifest" "cluster_issuer" {
+       api_version             = (known after apply)
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = (known after apply)
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = (known after apply)
+       namespace               = (known after apply)
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = (known after apply)
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.cluster_secretstore will be created
+   resource "kubectl_manifest" "cluster_secretstore" {
+       api_version             = (known after apply)
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = (known after apply)
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = (known after apply)
+       namespace               = (known after apply)
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = (known after apply)
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.externalsecret will be created
+   resource "kubectl_manifest" "externalsecret" {
+       api_version             = "external-secrets.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "ExternalSecret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "oauth2-proxy-secret"
+       namespace               = "authgate"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #175](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15214192767)